[{"Serial":69,"EXAppID":1,"EXTreeClassificationID":0,"Name":"Who We Are?","InternalRemarks":"Softex is a well-established software development house, providing different ERP solutions related to multiple industries and fields of operation. Softex was founded back in 2004 , and since then it provided over 1200 corporates with professional , reliable, and cost-efficient ERP Solutions. With a wide range of technical expertise on board as well as mature ERP Modules, we at Softex are considered a reliable value-added software solutions provider. over the time, our products have gained a considerable market share in different industries within Egypt and Mena Region. With a success record of over 2000 projects in Medium to large size corporations. Holding such a market share for long time depends on our commitment to honor our main values for delivery","ShortDescription":"For over 20 years, our team of business and software development experts have delivered all our solutions with reliability, security and ensured the right ROI for our customers at any given time. As we always take the responsibility of making the implementation successful since it is our own product to care for.","Description":"","Description_HTML":null,"DisplayOrder":0,"ParentID":68,"NewsTopic_HTMLLink":"","TreeClassifications_Setup":null,"Images":null,"WebSections":[{"Serial":151,"Title":"1","Details":"","DetailsHtml":"","DisplayOrder":0,"IsHTML":0,"ServerNow":"2024-09-08T08:59:00","URL":"","ToolTip":"  We deliver Reliable Software systems that run for years ensuring customers investment is well paid for.","WebSection_HTM_Link":"","Images":null},{"Serial":152,"Title":"2","Details":"","DetailsHtml":"","DisplayOrder":0,"IsHTML":0,"ServerNow":"2024-09-08T09:00:00","URL":"","ToolTip":"  We build our own Software Solutions ensuring we can provide the maximum support for our customers.","WebSection_HTM_Link":"","Images":null},{"Serial":153,"Title":"3","Details":"","DetailsHtml":"","DisplayOrder":0,"IsHTML":0,"ServerNow":"2024-09-08T09:00:00","URL":"","ToolTip":"  We provide Continuous update for our Software Solutions ensuring every year   of usage is delivering more value to our customers.","WebSection_HTM_Link":"","Images":null},{"Serial":154,"Title":"4","Details":"","DetailsHtml":"","DisplayOrder":0,"IsHTML":0,"ServerNow":"2024-09-08T09:00:00","URL":"","ToolTip":"  We always focus on Ease of use, while maintaining maximum possible security and performance at any given time.","WebSection_HTM_Link":"","Images":null}],"Translations":null,"TreeNode":[],"TreeNodes_Items":null}]